Conf.Simple/src/InformationRegisters/SUI_docs_tbl_series/SUI_docs_tbl_series.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_docs_tbl_series</name>
  <resources>
    <name>id_good</name>
    <comment>Номенклатура</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_properties</name>
    <comment>Характеристика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_series</name>
    <comment>Серия</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_warehouse</name>
    <comment>Склад</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>qtty</name>
    <comment>Количество</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>additional_details</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>best_before</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>number</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>production_date</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбработки</name>
    <type>
      <types>EnumRef.SUI_СтатусыОбработкиСтрок</types>
    </type>
  </attributes>
  <dimensions>
    <name>sid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>sid_doc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Enums/SUI_СтатусыОбработкиСтрок/SUI_СтатусыОбработкиСтрок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_СтатусыОбработкиСтрок</name>
  <enumValues>
    <name>Новая</name>
  </enumValues>
  <enumValues>
    <name>Пропущена</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаНеТребуется</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/InformationRegisters/SUI_docs_tbl_series/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьТаблицуЭталон() Экспорт
	
	Таблица = Новый ТаблицаЗначений();
	
	Для Каждого Колонка Из SUI_ДокументыОбменаПовтИсп.КолонкиТаблицыСерии() Цикл
		Таблица.Колонки.Добавить(Колонка.Имя, Колонка.Тип, Колонка.Заголовок);
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Функция ЗагрузитьИзМобильногоУстройства(ИдентификаторДокументаОбмена, ЗагружаемаяТаблица) Экспорт
	
	Если ЗагружаемаяТаблица.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗагружаемаяТаблица", ЗагружаемаяТаблица);
	Запрос.УстановитьПараметр("ИдентификаторДокументаОбмена", ИдентификаторДокументаОбмена);
	Запрос.УстановитьПараметр("ДатаОбновления", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ШаблонИдентификатораSimple", SUI_ИнтеграцияВКонфигурациюКлиентСервер.ШаблонИдентификатораSimple());
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗагружаемаяТаблица.id_good,
		|	ЗагружаемаяТаблица.id_properties,
		|	ЗагружаемаяТаблица.id_series,
		|	ЗагружаемаяТаблица.id_warehouse,
		|	ЗагружаемаяТаблица.qtty,
		|	ЗагружаемаяТаблица.name,
		|	ЗагружаемаяТаблица.number,
		|	ЗагружаемаяТаблица.production_date,
		|	ЗагружаемаяТаблица.best_before
		|ПОМЕСТИТЬ втЗагружаемаяТаблица
		|ИЗ
		|	&ЗагружаемаяТаблица КАК ЗагружаемаяТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СерииДокументаОбмена.sid,
		|	СерииДокументаОбмена.id_good,
		|	СерииДокументаОбмена.id_properties,
		|	СерииДокументаОбмена.id_series,
		|	СерииДокументаОбмена.id_warehouse,
		|	СерииДокументаОбмена.qtty,
		|	СерииДокументаОбмена.additional_details,
		|	СерииДокументаОбмена.best_before,
		|	СерииДокументаОбмена.name,
		|	СерииДокументаОбмена.number,
		|	СерииДокументаОбмена.production_date,
		|	СерииДокументаОбмена.ДатаОбновления,
		|	СерииДокументаОбмена.СтатусОбработки
		|ПОМЕСТИТЬ втСерииДокументаОбмена
		|ИЗ
		|	РегистрСведений.SUI_docs_tbl_series КАК СерииДокументаОбмена
		|ГДЕ
		|	СерииДокументаОбмена.sid_doc = &ИдентификаторДокументаОбмена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(втСерииДокументаОбмена.sid, """") КАК sid,
		|	&ИдентификаторДокументаОбмена КАК sid_doc,
		|	втЗагружаемаяТаблица.id_good,
		|	втЗагружаемаяТаблица.id_properties,
		|	ЕСТЬNULL(втСерииДокументаОбмена.id_series, ВЫБОР
		|		КОГДА втЗагружаемаяТаблица.id_series ПОДОБНО &ШаблонИдентификатораSimple
		|			ТОГДА втЗагружаемаяТаблица.id_series
		|		ИНАЧЕ """"
		|	КОНЕЦ) КАК id_series,
		|	втЗагружаемаяТаблица.id_warehouse,
		|	втЗагружаемаяТаблица.qtty,
		|	втЗагружаемаяТаблица.name,
		|	втЗагружаемаяТаблица.number,
		|	втЗагружаемаяТаблица.production_date,
		|	втЗагружаемаяТаблица.best_before,
		|	ЕСТЬNULL(втСерииДокументаОбмена.additional_details, """") КАК additional_details,
		|	ВЫБОР
		|		КОГДА втСерииДокументаОбмена.sid ЕСТЬ NULL
		|		ИЛИ втСерииДокументаОбмена.id_series ЕСТЬ NULL
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиСтрок.Новая)
		|		ИНАЧЕ втСерииДокументаОбмена.СтатусОбработки
		|	КОНЕЦ КАК СтатусОбработки,
		|	&ДатаОбновления КАК ДатаОбновления
		|ИЗ
		|	втЗагружаемаяТаблица КАК втЗагружаемаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ втСерииДокументаОбмена КАК втСерииДокументаОбмена
		|		ПО втЗагружаемаяТаблица.id_good = втСерииДокументаОбмена.id_good
		|		И втЗагружаемаяТаблица.id_properties = втСерииДокументаОбмена.id_properties
		|		И втЗагружаемаяТаблица.id_warehouse = втСерииДокументаОбмена.id_warehouse
		|		И ВЫБОР
		|			КОГДА втЗагружаемаяТаблица.id_series ПОДОБНО &ШаблонИдентификатораSimple
		|				ТОГДА втЗагружаемаяТаблица.id_series = втСерииДокументаОбмена.id_series
		|			КОГДА втЗагружаемаяТаблица.name <> """"
		|			И втЗагружаемаяТаблица.number <> """"
		|				ТОГДА втЗагружаемаяТаблица.name = втСерииДокументаОбмена.name
		|				И втЗагружаемаяТаблица.number = втСерииДокументаОбмена.number
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_docs_tbl_series");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("sid", "sid");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("sid_doc", "sid_doc");
		Блокировка.Заблокировать();
		
		Пока Выборка.Следующий() Цикл
			
			Запись = СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			
			Если ПустаяСтрока(Запись.sid) Тогда
				
				Если Не SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Запись.id_good) Тогда
					
					ДанныеСтрокой = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка);
					ДанныеСтрокой = ОбщегоНазначения.ЗначениеВСтрокуXML(ДанныеСтрокой);
					
					ТекстОшибки = НСтр("ru = 'Идентификатор номенклатуры не является идентификатором Simple.
					|%1'");
					ТекстОшибки = СтрШаблон(ТекстОшибки, ДанныеСтрокой);
					
					ВызватьИсключение ТекстОшибки;
					
				КонецЕсли;
				
				Запись.sid = Новый УникальныйИдентификатор();
				
			КонецЕсли;
			
			Запись.Записать(Истина);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = НСтр("ru = 'Не удалось загрузить серии документа обмена (%1)!'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, ИдентификаторДокументаОбмена);
		ВызватьИсключение(ТекстОшибки, , , , ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
